apache/nuttx/arch/arm/src/stm32f0/hardware/stm32f0_syscfg.h
#define SYSCFG_CFGR2_LOCKUPLOCK        (1 << 0)  /* Bit 0: Cortex-M0 Hardfault output bit enable */
#define SYSCFG_CFGR2_SRAM_PARITYLOCK   (1 << 1)  /* Bit 1: RAM parity lock */
#define SYSCFG_CFGR2_PVDLOCK           (1 << 2)  /* Bit 2: PVD lock enable */
#define SYSCFG_CFGR2_SRAM_PEF          (1 << 8)  /* Bit 8: SRAM parity error */

/* SYSCFG interrupt line 0 status register */

#define SYSCFG_ITLINE0_WWDG            (1 << 0)  /* Bit 0: Window Watchdog interrupt pending flag */

/* SYSCFG interrupt line 1 status register */

#define SYSCFG_ITLINE1_PVDOUT          (1 << 0)  /* Bit 0: PVD supply monitoring interrupt request pending (EXTI line 16) */
#define SYSCFG_ITLINE1_VDDIO2          (1 << 0)  /* Bit 1: VDDIO2 supply monitoring interrupt request pending (EXTI line 31) */

/* SYSCFG interrupt line 2 status register */

#define SYSCFG_ITLINE2_RTC_WAKEUP      (1 << 0)  /* Bit 0: RTC Wake Up interrupt request pending (EXTI line 20) */
#define SYSCFG_ITLINE2_RTC_TSTAMP      (1 << 1)  /* Bit 1: RTC Tamper and TimeStamp interrupt request pending (EXTI line 19) */
#define SYSCFG_ITLINE2_RTC_ALRA        (1 << 2)  /* Bit 2: RTC Alarm interrupt request pending (EXTI line 17) */

/* SYSCFG interrupt line 3 status register */

#define SYSCFG_ITLINE3_FLASH_ITF       (1 << 0)  /* Bit 0: Flash interface interrupt request pending */

/* SYSCFG interrupt line 4 status register */

#define SYSCFG_ITLINE4_RCC             (1 << 0)  /* Bit 0: Reset and clock control interrupt request pending */
#define SYSCFG_ITLINE4_CRS             (1 << 1)  /* Bit 1: Clock recovery system interrupt request pending */

/* SYSCFG interrupt line 5 status register */

#define SYSCFG_ITLINE5_EXTI0           (1 << 0)  /* Bit 0: EXTI line 0 interrupt request pending */
#define SYSCFG_ITLINE5_EXTI1           (1 << 1)  /* Bit 1: EXTI line 1 interrupt request pending */

/* SYSCFG interrupt line 6 status register */

#define SYSCFG_ITLINE6_EXTI2           (1 << 0)  /* Bit 0: EXTI line 2 interrupt request pending */
#define SYSCFG_ITLINE6_EXTI3           (1 << 1)  /* Bit 1: EXTI line 3 interrupt request pending */

/* SYSCFG interrupt line 7 status register */

#define SYSCFG_ITLINE7_EXTI4           (1 << 0)  /* Bit 0: EXTI line 4 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI5           (1 << 1)  /* Bit 1: EXTI line 5 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI6           (1 << 2)  /* Bit 2: EXTI line 6 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI7           (1 << 3)  /* Bit 3: EXTI line 7 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI8           (1 << 4)  /* Bit 4: EXTI line 8 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI9           (1 << 5)  /* Bit 5: EXTI line 9 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI10          (1 << 6)  /* Bit 6: EXTI line 10 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI11          (1 << 7)  /* Bit 7: EXTI line 11 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI12          (1 << 8)  /* Bit 8: EXTI line 12 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI13          (1 << 9)  /* Bit 9: EXTI line 13 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI14          (1 << 10) /* Bit 10: EXTI line 14 interrupt request pending */
#define SYSCFG_ITLINE7_EXTI15          (1 << 11) /* Bit 11: EXTI line 15 interrupt request pending */

/* SYSCFG interrupt line 8 status register */

#define SYSCFG_ITLINE8_TCS_MCE         (1 << 0)  /* Bit 0: Touch sensing controller max count error interrupt request pending */
#define SYSCFG_ITLINE8_TCS_EOA         (1 << 1)  /* Bit 1: Touch sensing controller end of acquisition interrupt request pending */

/* SYSCFG interrupt line 9 status register */

#define SYSCFG_ITLINE9_DMA1_CH1        (1 << 0)  /* Bit 0: DMA1 channel 1 interrupt request pending */

/* SYSCFG interrupt line 10 status register */

#define SYSCFG_ITLINE10_DMA1_CH2       (1 << 0)  /* Bit 0: DMA1 channel 2 interrupt request pending */
#define SYSCFG_ITLINE10_DMA1_CH3       (1 << 1)  /* Bit 1: DMA1 channel 3 interrupt request pending */
#define SYSCFG_ITLINE10_DMA2_CH1       (1 << 2)  /* Bit 0: DMA2 channel 1 interrupt request pending */
#define SYSCFG_ITLINE10_DMA2_CH2       (1 << 3)  /* Bit 1: DMA2 channel 2 interrupt request pending */

/* SYSCFG interrupt line 11 status register */

#define SYSCFG_ITLINE11_DMA1_CH4       (1 << 0)  /* Bit 0: DMA1 channel 4 interrupt request pending */
#define SYSCFG_ITLINE11_DMA1_CH5       (1 << 1)  /* Bit 1: DMA1 channel 5 interrupt request pending */
#define SYSCFG_ITLINE11_DMA1_CH6       (1 << 2)  /* Bit 2: DMA1 channel 6 interrupt request pending */
#define SYSCFG_ITLINE11_DMA1_CH7       (1 << 3)  /* Bit 3: DMA1 channel 7 interrupt request pending */
#define SYSCFG_ITLINE11_DMA2_CH3       (1 << 4)  /* Bit 4: DMA2 channel 3 interrupt request pending */
#define SYSCFG_ITLINE11_DMA2_CH4       (1 << 5)  /* Bit 5: DMA2 channel 4 interrupt request pending */
#define SYSCFG_ITLINE11_DMA2_CH5       (1 << 6)  /* Bit 6: DMA2 channel 5 interrupt request pending */

/* SYSCFG interrupt line 12 status register */

#define SYSCFG_ITLINE12_ADC            (1 << 0)  /* Bit 0: ADC interrupt request pending */
#define SYSCFG_ITLINE12_COMP1          (1 << 1)  /* Bit 1: Comparator 1 interrupt request pending */
#define SYSCFG_ITLINE12_COMP2          (1 << 2)  /* Bit 2: Comparator 2 interrupt request pending */

/* SYSCFG interrupt line 13 status register */

#define SYSCFG_ITLINE13_TIM1_CCU       (1 << 0)  /* Bit 0: TIM1 commutation interrupt request pending */
#define SYSCFG_ITLINE13_TIM1_TRG       (1 << 1)  /* Bit 1: TIM1 triggerinterrupt request pending */
#define SYSCFG_ITLINE13_TIM1_UPD       (1 << 2)  /* Bit 2: TIM1 update interrupt request pending */
#define SYSCFG_ITLINE13_TIM1_BRK       (1 << 3)  /* Bit 3: TIM1 break interrupt request pending */

/* SYSCFG interrupt line 14 status register */

#define SYSCFG_ITLINE14_TIM1_CC        (1 << 0)  /* Bit 0: TIM1 capture compare interrupt request pending */

