apache/nuttx/arch/arm/src/stm32f0/hardware/stm32f0_syscfg.h
/* SYSCFG interrupt line 15 status register */

#define SYSCFG_ITLINE15_TIM2           (1 << 0)  /* Bit 0: Timer 2 interrupt request pending */

/* SYSCFG interrupt line 16 status register */

#define SYSCFG_ITLINE16_TIM3           (1 << 0)  /* Bit 0: Timer 3 interrupt request pending */

/* SYSCFG interrupt line 17 status register */

#define SYSCFG_ITLINE17_TIM6           (1 << 0)  /* Bit 0: Timer 6 interrupt request pending */
#define SYSCFG_ITLINE17_DAC            (1 << 1)  /* Bit 1: DAC underrun interrupt request pending */

/* SYSCFG interrupt line 18 status register */

#define SYSCFG_ITLINE18_TIM7           (1 << 0)  /* Bit 0: Timer 7 interrupt request pending */

/* SYSCFG interrupt line 19 status register */

#define SYSCFG_ITLINE19_TIM14          (1 << 0)  /* Bit 0: Timer 14 interrupt request pending */

/* SYSCFG interrupt line 20 status register */

#define SYSCFG_ITLINE20_TIM15          (1 << 0)  /* Bit 0: Timer 15 interrupt request pending */

/* SYSCFG interrupt line 21 status register */

#define SYSCFG_ITLINE21_TIM16          (1 << 0)  /* Bit 0: Timer 16 interrupt request pending */

/* SYSCFG interrupt line 22 status register */

#define SYSCFG_ITLINE22_TIM17          (1 << 0)  /* Bit 0: Timer 17 interrupt request pending */

/* SYSCFG interrupt line 23 status register */

#define SYSCFG_ITLINE23_I2C1           (1 << 0)  /* Bit 0: I2C1 interrupt request pending, combined with EXTI line 23 */

/* SYSCFG interrupt line 24 status register */

#define SYSCFG_ITLINE24_I2C2           (1 << 0)  /* Bit 0: I2C2 interrupt request pending */

/* SYSCFG interrupt line 25 status register */

#define SYSCFG_ITLINE25_SPI1           (1 << 0)  /* Bit 0: SPI1 interrupt request pending */

/* SYSCFG interrupt line 26 status register */

#define SYSCFG_ITLINE26_SPI2           (1 << 0)  /* Bit 0: SPI2 interrupt request pending */

/* SYSCFG interrupt line 27 status register */

#define SYSCFG_ITLINE27_USART1         (1 << 0)  /* Bit 0: USART1 interrupt request pending */

/* SYSCFG interrupt line 28 status register */

#define SYSCFG_ITLINE28_USART2         (1 << 0)  /* Bit 0: USART2 interrupt request pending */

/* SYSCFG interrupt line 29 status register */

#define SYSCFG_ITLINE29_USART3         (1 << 0)  /* Bit 0: USART3 interrupt request pending */
#define SYSCFG_ITLINE29_USART4         (1 << 1)  /* Bit 1: USART4 interrupt request pending */
#define SYSCFG_ITLINE29_USART5         (1 << 2)  /* Bit 2: USART5 interrupt request pending */
#define SYSCFG_ITLINE29_USART6         (1 << 3)  /* Bit 3: USART6 interrupt request pending */
#define SYSCFG_ITLINE29_USART7         (1 << 4)  /* Bit 4: USART7 interrupt request pending */
#define SYSCFG_ITLINE29_USART8         (1 << 5)  /* Bit 5: USART8 interrupt request pending */

/* SYSCFG interrupt line 30 status register */

#define SYSCFG_ITLINE30_CEC            (1 << 0)  /* Bit 0: CEC interrupt request pending, combined with EXTI line 27 */
#define SYSCFG_ITLINE30_CAN            (1 << 1)  /* Bit 1: CAN interrupt request pending */

#endif /* __ARCH_ARM_SRC_STM32F0_HARDWARE_STM32F0_SYSCFG_H */
